[
  {
    "id": "robotics",
    "type": "Robotics",
    "short_info": "Six-Axis Industrial Robotic Arm",
    "long_info": "The robotic arm can perform a wide range of activities and jobs that humans cannot.We built the project everything from scratch even the nut and bolt are made using 3d printer expect metal parts, especially those that are sensitive to friction, such as gears and bearings, wear out extremely quickly. The whole project was developed from the ground up, providing my team with valuable learning and working experience. This project was a roller coaster ride for me as I experiment with different technologies like as Ros, Arduino,OpenCV and Raspberry pie, as well as the electric shock and smoke effect, where the whole commitment was placed to accomplish this project.",
    "main_img": "images/robotics/robotic_arm_main.jpg",
    "blog_img": "images/robotics/robotic-parts.jpg",
    "gallery": [
      "images/robotics/robotic arm copy.gif",
      "images/robotics/3d-printer.png",
      "images/robotics/me-robotics.jpg",
      "images/robotics/parts-robotics.jpg",
      "images/robotics/robotic arm.gif",
      "images/robotics/robotic arm.jpg",
      "images/robotics/robotic_arm_main.jpg",
      "images/robotics/robotic-parts.jpg",
      "images/robotics/robotics_wire.jpg"
    ],
    "badges": [
      "images/logos/ros_logo.png",
      "images/logos/arduino.png",
      "images/logos/python.jpeg",
      "images/logos/RPi-Logo-Stacked-PRINT.png"
    ]
  },
  {
    "id": "computer_vision",
    "type": "Computer Vision",
    "short_info": "Identifing Industrial TMT Rods",
    "long_info": "TMT(Thermo Mechanical treatment) rods are the walloping production of the steel industries and they require tailor-made measurements for each construction site. for that there are huge machines that will make the task of cutting TMT rods easier for industries. while cutting the rods they measure for efficient cutting for that they use a photoelectric sensor, Manual labor, and complex computing machine that ended up in huge maintenance of the machines and time-consuming process, in the last decade research on Digital image processing and computer vision has seen much progress.  I developed a methodology that is adaptable for the industries in measuring TMT rods much more efficiently , robust towards cram-full of rods, and minimizing the error rate. The captured digital image first undergoes the preprocessing phase where the first step is image enhancement and then edge detection, which extracts the TMT rods edges then followed by the diameter calculations (pixels per metric). An experiment was conducted on a variety of challenging conditions to demonstrate the capability of our approach to a good measure of success   This concept gives me optimism for the future of AI (Computer Vision) in construction equipment and materials. The challenges became even greater when it came to the production level, as construction sites were littered with sawdust, which caused a lot of noise in the image and made our job even more difficult in the preprocessing stage. Another issue was the lack of a bright light, which we needed to capture the image. A right contrast of light is required while capturing the image that will help us in identifying the edges of the rod this was later rectified through a  contrast library mdoule",
    "main_img": "images/tmt_rods/tmt_main.png",
    "blog_img": "images/tmt_rods/tmt_main.png",
    "gallery": [
      "images/tmt_rods/IMG_20191010_143316.jpg",
      "images/tmt_rods/tmt_black.png",
      "images/tmt_rods/tmt_canny_edge.png",
      "images/tmt_rods/tmt_historgram.png",
      "images/tmt_rods/tmt_rgb.png",
      "images/tmt_rods/tmt_size_fail.png",
      "images/tmt_rods/tmt_main.png"
    ],
    "badges": [
      "images/logos/opencv.png",
      "images/logos/python.jpeg",
      "images/logos/RPi-Logo-Stacked-PRINT.png"
    ]
  },
  {
    "id": "mechtronics",
    "type": "Mechtronics",
    "short_info": "Anti-Collision of Tower-Cranes",
    "long_info": "This project was a comprehensive learning experience for me, from understanding the fundamentals of electronics to mechanical engineering. This is a project where you save lives, yes that's correct, it was a project where you needed to prevent tower cranes from colliding. The initial prototype was created in Rasberri Pie and developed in Python. It was afterwards migrated to indurstial hardware such as PLC (process logic controller) and VFD where the entire logic was the same. The deployment phase was the most difficult phase because after a lot of rigorous testing on the prototype we were finally confident about, no one came forward for the final production because if the project failed, it would cost millions of dollars in property damage, which was insane, but after a lot of demo and the confidence we carried that made us into final deployment, yes we finally deployed it in on wipro construction site hyderabad the first phase was succesfull.  If you ask me what the logic is behind it, I would say a basic mathematical formula that I learnt in high school arithmetic, yes the shortest distance between two line segments. Finally, the grade paid for this project, The outcome of this project where I overcame my fear of heights as a result of it, and I dropped about 5kg. I later realised that this project was a whole wealth of experience. ",
    "main_img": "images/anti-collision/anti-collision.jpg",
    "blog_img": "images/anti-collision/anti-collision.jpg",
    "gallery": [
      "images/anti-collision/IMG_20191022_105915.jpg",
      "images/anti-collision/anti-collsion.jpg",
      "images/anti-collision/anti-collision.jpg"
    ],
    "badges": [
      "images/logos/RPi-Logo-Stacked-PRINT.png",
      "images/logos/ros_logo.png"
    ]
  },
  {
    "id": "web_development",
    "type": "Web Development",
    "short_info": "Platform to share Post/Voice (Instagram Clone)",
    "long_info": "It's an open source platform for voice sharing. The major concept behind making this is to demonstrate my capabilities in MERN stack application. It also enables post sharing with a variety of features such as chat, friend request. I created the entire design from scratch hope you liked it. It covers subjects like socket io, rest api, and kafka. Please follow the link below to see a demo.",
    "main_img": "images/rasa/rasa5.png",
    "blog_img": "images/rasa/rasa6.jpeg",
    "gallery": [
      "images/rasa/rasa1.jpeg",
      "images/rasa/rasa2.jpeg",
      "images/rasa/rasa3.jpeg",
      "images/rasa/rasa4.jpeg",
      "images/rasa/rasa5.png",
      "images/rasa/rasa7.png"
    ],
    "badges": ["images/rasa/mern_badge.png"],
    "demo": "True"
  },
  {
    "id": "chat_bot",
    "type": "Chat-Bot Development",
    "short_info": "Chat-Bot",
    "long_info": "Rasa on a serious only open source AI NLP framework that has potential to scale on enterprise level. I have tested worked practically on many other NLP framework, but this is killer in this area. I built more than 2 chatbot actively served more than 20k users",
    "main_img": "images/chatbot/chatbot.png",
    "blog_img": "images/chatbot/chatbot.png",
    "gallery": [],
    "badges": ["images/logos/rasa.png", "images/logos/python.jpeg"]
  }
]
